def can_exit(lst: list) -> bool:
    """ Функция определяет, можно ли пройти с левого верхнего угла матрицы до правого нижнего,
    двигаясь по нулям влево-вправо-вверх-вниз.
    :param lst: матричный двумерный список
    :return: True or False.
    """
    flag: int = 3  # Маркер для прохода матрицы
    if lst[0][0] == 0:
        lst[0][0] = flag
    for i in range(len(lst)):
        for j in range(len(lst[i])):
            if lst[i][j] == flag:
                # Обработка граничащих с маркером позиций
                for x in range(-1, 2):
                    for y in range(-1, 2):
                        # Убираем из обработки позиции по диагонали от маркера
                        if x != y and x + y != 0:
                            # Проверка невыхода за границы матрицы
                            if i + x >= 0 and j + y >= 0 and i + x < len(lst) and j + y < len(lst[i]):
                                # Меняем 0 на маркер
                                if lst[i + x][j + y] == 0:
                                    lst[i + x][j + y] = flag
    return lst[-1][-1] == flag


if __name__ == "__main__":
    assert can_exit([
        [0, 1, 1, 1, 1, 1, 1],
        [0, 0, 1, 1, 0, 1, 1],
        [1, 0, 0, 0, 0, 1, 1],
        [1, 1, 1, 1, 0, 0, 1],
        [1, 1, 1, 1, 1, 0, 0]
    ])

    assert not can_exit([
        [0, 1, 1, 1, 1, 1, 1],
        [0, 0, 1, 0, 0, 1, 1],
        [1, 0, 0, 0, 0, 1, 1],
        [1, 1, 0, 1, 0, 0, 1],
        [1, 1, 0, 0, 1, 1, 1]
    ])

    assert not can_exit([
        [0, 1, 1, 1, 1, 0, 0],
        [0, 0, 0, 0, 1, 0, 0],
        [1, 1, 1, 0, 0, 0, 0],
        [1, 1, 1, 1, 1, 1, 0],
        [1, 1, 1, 1, 1, 1, 1]
    ])

    assert can_exit([
        [0, 1, 1, 1, 1, 0, 0],
        [0, 0, 0, 0, 1, 0, 0],
        [1, 1, 1, 0, 0, 0, 0],
        [1, 0, 0, 0, 1, 1, 0],
        [1, 1, 1, 1, 1, 1, 0]
    ])

    assert not can_exit([
        [0, 1, 1, 1, 1, 0, 0],
        [0, 0, 0, 0, 1, 0, 0],
        [1, 1, 1, 0, 1, 0, 0],
        [1, 0, 0, 1, 1, 1, 0],
        [1, 1, 1, 1, 1, 1, 0]
    ])
